Revit 2026 API

# ElementParameters Property

---

Retrieves a set containing all of the parameters that are contained within the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ParameterSet Parameters { get; }
```
```vb
Public ReadOnly Property Parameters As ParameterSet
	Get
```
```cpp
public:
property ParameterSet^ Parameters {
	ParameterSet^ get ();
}
```
```fsharp
member Parameters : ParameterSet with get
```

#### Property Value

ParameterSet

The Parameters property contains a set of all the parameters that the element supports. These parameters are displayed in the Element properties dialog in the Autodesk Revit interface. These parameters can be retrieved and set via the parameter objects stored in this set.

#### Reference

Element Class

Autodesk.Revit.DB Namespace